app/Models/TaskModel.php

    public function getTodayTasks()
    {
        return $this->where('task_date', '2026-09-26')
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-28'
ORDER BY `created_at` DESC

    public function getAllTasks()
    {
        return $this->orderBy('task_date', 'DESC')
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `tasks`
ORDER BY `task_date` DESC, `created_at` DESC