app/Models/UserModel.php

SELECT *
FROM `users`
 LIMIT 1
---
    public function getDemoUser()
    {
        return $this->first();